tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Distributed revision control system
brew "git"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Statically typed programming language for the JVM
brew "kotlin"
# Platform built on V8 to build network applications
brew "node"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Generate scripting interfaces to C/C++ code
brew "swig"
# General-purpose lossless data-compression library
brew "zlib"
# Tool to hide status bar icons
cask "dozer"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Clipboard manager
cask "maccy"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin21"
