tap "buo/cask-upgrade"
tap "oven-sh/bun"
# wget Internet file retriever
brew "wget"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Distributed revision control system
brew "git"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Statically typed programming language for the JVM
brew "kotlin"
# Platform built on V8 to build network applications
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Generate scripting interfaces to C/C++ code
brew "swig"
# General-purpose lossless data-compression library
brew "zlib"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes package manager
brew "helm"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Official Amazon AWS command-line interface
brew "awscli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Bun is an all-in-one toolkit for JavaScript and TypeScript apps
brew "bun"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Fast, disk space efficient package manager
brew "pnpm"
# Statistics utility to count lines of code
brew "cloc"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Command-line fuzzy finder written in Go
brew "fzf"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Shell history search with sync and TUI
brew "atuin"
# Smarter cd command
brew "zoxide"
# Per-directory environment loader
brew "direnv"
# Syntax-highlighting pager for git and diff
brew "git-delta"
# Modern ls replacement with icons and git info
brew "eza"
# Modern terminal resource monitor
brew "btop"
# Official tldr client written in Rust
brew "tlrc"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Intuitive find & replace CLI
brew "sd"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Clipboard manager
cask "maccy"
# Latest JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK 21 from the Eclipse Foundation (Adoptium)
cask "temurin@21"
# Google Chrome
cask "google-chrome"
# Google Cloud SDK
cask "google-cloud-sdk"
# Spotify
cask "spotify"
# TempBox
cask "tempbox"
# Fira Code
cask "font-fira-code"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Hidden Bar lets you hide menu bar items to give your Mac a cleaner look.
cask "hiddenbar"
# E-books management software
cask "calibre"
# Open-source code editor
cask "visual-studio-code"
# Peer-to-peer BitTorrent client
cask "qbittorrent"
# Multimedia player
cask "vlc"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# REST, GraphQL and gRPC client
cask "yaak"
# Software for Logitech devices
cask "logi-options+"
# Video communication and virtual meeting platform
cask "zoom"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Write, edit, and chat about your code with AI
cask "cursor"
# AtkynsonMono Nerd Font (Atkinson Hyperlegible Mono)
cask "font-atkynson-mono-nerd-font"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
