tap "buo/cask-upgrade"
# wget Internet file retriever
brew "wget"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Distributed revision control system
brew "git"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Statically typed programming language for the JVM
brew "kotlin"
# Platform built on V8 to build network applications
brew "node"
# Python version management
brew "pyenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Generate scripting interfaces to C/C++ code
brew "swig"
# General-purpose lossless data-compression library
brew "zlib"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool to hide status bar icons
cask "dozer"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Clipboard manager
cask "maccy"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Google Chrome
cask "google-chrome"
# Google Cloud SDK
cask "google-cloud-sdk"
# Spotify
cask "spotify"
# TempBox
cask "tempbox"
